sulaolab/dspic33ak-spi-i2s-tdm-hal/src/dspic33ak_spi_i2s_tdm.h
#ifndef DSPIC33AK_SPI_I2S_TDM_H
#define DSPIC33AK_SPI_I2S_TDM_H

//===========================================================
// Device identity (HAL-owned adapter). Maps the toolchain's -mcpu predefined macro to an
// opaque, module-prefixed tag in ONE place; the silicon layer (hw.{c,h}) selects the SPI
// device-facts table / instance count on it. Self-contained: depends only on the compiler
// macro, never on app config. Add a sibling part by OR-ing it into one arm here -- the
// single part-number change point. Tag values arbitrary; compare with == only (never
// order / arithmetic). This HAL hard-#errors on an unsupported device.
//===========================================================
#define DSPIC33AK_SPI_I2S_TDM_DEV_AK512   (1)
#define DSPIC33AK_SPI_I2S_TDM_DEV_AK128   (2)

#if   defined(__dsPIC33AK512MPS512__)
  #define DSPIC33AK_SPI_I2S_TDM_DEVICE    DSPIC33AK_SPI_I2S_TDM_DEV_AK512
#elif defined(__dsPIC33AK128MC106__)
  #define DSPIC33AK_SPI_I2S_TDM_DEVICE    DSPIC33AK_SPI_I2S_TDM_DEV_AK128
#else
  #error "Unsupported device -- the SPI/I2S/TDM HAL expects __dsPIC33AK512MPS512__ or __dsPIC33AK128MC106__."
#endif

//===========================================================
// dspic33ak_spi_i2s_tdm.{c,h} + dspic33ak_spi_i2s_tdm_reg.h = the reusable SPI/I2S/TDM
// transport HAL core (Perseus-derived; also published standalone as dspic33ak-spi-i2s-tdm-hal
// and vendored into dspic33ak-hal-starter -- the same source across all three). Known
// sibling-HAL dependencies are listed below. It does: SPI framed-mode (I2S/TDM) setup,
// DMA + ping-pong buffers,
// block callback, start/stop/configure/get_status, and deadline-miss + load
// diagnostics. It is RATE-AGNOSTIC (no sample-rate state/API -- runs at the configured
// BRG / external clock). It does NOT do DSP, codec (WM8904), PPS/CLC pins, or app config
// -- a client registers a block callback and a board/clock port.
//   - audio_app_board.* (audio_app/) = Perseus board-adapter EXAMPLE (not core).
//   - audio_app.* (audio_app/)                  = Perseus demo app layer (not core).
// Pin/CLC + external-clock concerns are reached through the registered port
// (set_port()) -- the core no longer includes the board adapter, nor app config.
// Compile-time stream geometry + topology come from a project-supplied
// dspic33ak_spi_i2s_tdm_conf.h. The HAL core only depends on DSPIC33AK_TDM_* macros
// from that header -- it does not read app symbols directly. The publishable example
// config (conf.h_example in the HAL folder) is self-contained and app-independent.
// The in-tree project config (src/dspic33ak_spi_i2s_tdm_conf.h) may derive
// DSPIC33AK_TDM_* from APP_* for automatic consistency; that is the project's
// integration choice, not the HAL's requirement. Instance COUNT is chosen by
// DSPIC33AK_TDM_USE_SPI2 (1 or 2). The physical-SPI mapping is FIXED IN THE CORE (leg 0 =
// SPI1, leg 1 = SPI2) -- it does NOT come from conf.h; conf.h supplies only each leg's RX/TX
// DMA channels, geometry (SLOTS_PER_FS / BLOCK_FRAMES), and initial SYNC_DOMAIN seed. The
// core's leg enum, buffers, leg table, and _DMA<rx>Interrupt vectors are explicit C keyed off
// those (no generator macro). Supported-device limitation:
// the silicon-facts paths cover __dsPIC33AK512MPS512__ / __dsPIC33AK128MC106__ only (the
// core #error's otherwise; other parts need their facts added). Known sibling-HAL
// dependencies: dspic33ak_dma (required), and the load monitor's use of the hal_timer
// high-res public API (dspic33ak_high_res_timer_*, runtime-gated via is_initialized()) --
// a clean sibling-HAL dependency, like hal_dma. The debug-only deps (<stdio.h>,
// dspic33ak_tick_timer.h for timestamps, board_dbg_pins.h scope pins) are included only
// under ENA_TDM_DBG, so the default (debug-off) core pulls none of them.
//===========================================================

//===========================================================
// INCLUDES
//===========================================================
#include <stdint.h>
#include <stdbool.h>
#include "dspic33ak_spi_i2s_tdm_conf.h"   // HAL compile-time config (geometry/topology); exposes DSPIC33AK_TDM_* to consumers


//===========================================================
// Definition
//===========================================================


//===========================================================
// Enum & Struct typedef
//===========================================================

// Block-ISR load/time monitor: execution-time stats of one instance's RX-block ISR,
// in raw timer counts and 0.1us units. (Named after the load it measures, not a fixed
// DMA channel -- each instance's RX DMA channel is configurable in conf.h.)
typedef struct
{
    uint32_t last_count;
    uint32_t min_count;
    uint32_t max_count;
    uint32_t event_count;

    // us10 means 0.1 us unit.
    // Example: 1234 means 123.4 us.
    uint32_t last_us10;
    uint32_t min_us10;
    uint32_t max_us10;
} dspic33ak_spi_i2s_tdm_load_t;



//===========================================================
// Runtime SPI/I2S/TDM stream configuration.
//
// inst_configure() / configure_system() validate and store this configuration while stopped.
// open() then runs the platform pin/clock port hooks; a subsequent start (inst_start /
// start_domain / start_all_domains) applies the stored configuration to the SPI peripheral and
// DMA engine. The integrator supplies it (e.g. from a board config table) or builds it directly.
// Field comments map to the SPIxCON1 bit each one drives.
//===========================================================

// Frame format. Selects FRMCNT + the conventional FRMPOL used today.
//   I2S : FRMCNT=001 (FS every 2 words), FRMPOL active-low   (was ENA_FRMT_I2S)
//   TDM : FRMCNT=011 (FS every 8 words, TDM8), FRMPOL active-high
typedef enum {
    DSPIC33AK_SPI_I2S_TDM_FORMAT_I2S = 0,
    DSPIC33AK_SPI_I2S_TDM_FORMAT_TDM = 1,
} dspic33ak_spi_i2s_tdm_format_t;

// Bit-clock / frame-sync role.
//   SLAVE  : MSTEN=0, FRMSYNC=1 (FS input)   -- external BCLK/FS (Perseus today)
//   MASTER : MSTEN=1, FRMSYNC=0 (FS output)  -- self-clocked (starter target)
typedef enum {
    DSPIC33AK_SPI_I2S_TDM_CLOCK_SLAVE  = 0,
    DSPIC33AK_SPI_I2S_TDM_CLOCK_MASTER = 1,
} dspic33ak_spi_i2s_tdm_clock_role_t;

