sulaolab/dspic33ak-spi-i2s-tdm-hal/src/dspic33ak_spi_i2s_tdm.h
// External frame-sync (FS/LRCK) waveform shape. This is the user-facing INTENT; the HAL
// picks the hardware mechanism, so the application never deals with FRMSYPW/FRMCNT/CLC:
//   FS_PULSE   : short frame sync, one BCLK wide at the frame start (DSP/TDM "short sync").
//                FRMSYPW=0, FRMCNT=slots_per_fs. No CLC.
//   FS_50PCT   : 50%-duty FS, I2S LRCLK style.
//                - I2S (2 slots): native -- FRMSYPW=1 (a one-word pulse IS 50% of a 2-word
//                  frame). No CLC.
//                - TDM (>=4 slots), MASTER: the SPI emits a 1-BCLK half-frame marker
//                  (FRMSYPW=0, FRMCNT=slots_per_fs/2) that CLC10 toggles into a 50%-duty FS
//                  on the same FS pin. The HAL owns CLC10 + virtual pin RPV8 (see
//                  dspic33ak_spi_i2s_tdm_fs_clc.*).
//                - TDM SLAVE: FS is an INPUT, so fs_shape is accepted but has no
//                  generated-waveform effect (treated as normal slave framing). The CLC10
//                  50%-duty FS is generated only in master mode.
// NOTE: there is intentionally no "one-word-wide TDM" shape -- a word-wide TDM pulse is a
// niche non-50% long-frame sync and was dropped in favor of these two common intents.
typedef enum {
    DSPIC33AK_SPI_I2S_TDM_FS_PULSE = 0,   // short frame sync, ~1 BCLK (FRMSYPW=0)
    DSPIC33AK_SPI_I2S_TDM_FS_50PCT = 1,   // 50%-duty FS (I2S: native; TDM master: via CLC10)
} dspic33ak_spi_i2s_tdm_fs_shape_t;

typedef struct {
    dspic33ak_spi_i2s_tdm_format_t format;          // I2S vs TDM (FRMCNT/FRMPOL)
    dspic33ak_spi_i2s_tdm_clock_role_t   clock_role;      // master vs slave (MSTEN/FRMSYNC)
    uint8_t  slots_per_fs;                          // DSPIC33AK_TDM_SLOTS_PER_FS: I2S=2 / TDM8=8
    uint8_t  word_bits;                             // 32 (MODE32); only 32 validated
    dspic33ak_spi_i2s_tdm_fs_shape_t fs_shape;      // FS waveform intent (see enum). HAL derives
                                                    // FRMSYPW/FRMCNT and engages CLC10 as needed.
    uint16_t block_frames;                          // DSPIC33AK_TDM_BLOCK_FRAMES: frames per ping/pong half
    uint32_t brg;                                   // SPIxBRG (master only; ignored as slave)
    bool     mclk_enable;                           // MCLKEN (CLKGEN9 reference)
    bool     fs_coincides_first_bclk;               // SPIFE: 1=no delay, 0=1-bit delayed (ENA_1_BIT_DELAY)
    bool     bclk_idle_high;                        // CKP
    bool     bclk_change_on_active_to_idle;         // CKE
    bool     ignore_overflow;                       // IGNROV
    bool     ignore_underrun;                       // IGNTUR
} dspic33ak_spi_i2s_tdm_config_t;

// Clock-change event reported by the slave's external-clock detector
// (board RB15 / CN). STOPPED = the external bit/frame clock has stopped (e.g. the
// source is switching sample rate) -> the app should mute + stop. RESUMED = the
// clock is back -> the app should measure the rate, reconfigure, then restart.
// NONE = nothing pending. Consumed (read-and-clear) via
// dspic33ak_spi_i2s_tdm_consume_clock_event(); always NONE when the board has no
// external-clock detect (e.g. ENA_USB_AUDIO_IN undefined).
typedef enum {
    DSPIC33AK_SPI_I2S_TDM_CLOCK_EVENT_NONE = 0,
    DSPIC33AK_SPI_I2S_TDM_CLOCK_EVENT_STOPPED, // external clock stopped (rate switch begun)
    DSPIC33AK_SPI_I2S_TDM_CLOCK_EVENT_RESUMED, // external clock back
} dspic33ak_spi_i2s_tdm_clock_event_t;

// One-completed-block callback (event hook), registered PER SPI instance. The
// instance's RX-block ISR calls this for each completed block: src = the RX ping/pong
// half just captured by THIS instance; dst = the TX ping/pong half of THIS instance
// to fill; user = opaque context. One callback handles exactly one physical SPI's
// RX/TX block -- there is no dst_b / "second output": when two SPI instances are
// running, each has its own callback, and any cross-instance routing (e.g. mirroring
// one input to both outputs) is the application's job, done explicitly through a
// shared buffer between the two callbacks.
// Contract: register it (set_block_callback) BEFORE start(); do NOT clear it while
// running. If no callback is registered for an instance, that instance runs no
// app/DSP path (its zeroed TX half stays silent).
// Contract: when this callback is invoked, src and dst are both non-NULL. If the core
// cannot resolve either half-buffer (reload boundary / just-stopped / first block /
// fault), it skips the block instead of calling the callback -- the callee never
// NULL-checks src/dst.
typedef void (*dspic33ak_spi_i2s_tdm_block_cb_t)( const int32_t* src,
                                                  int32_t*       dst,
                                                  void*          user );

// Opaque per-physical-SPI instance handle. The engine exposes the two co-clocked SPI
// legs (SPI1 + optional SPI2) through the accessors below; pass the handle to
// inst_configure()/inst_start()/inst_stop()/set_block_callback()/inst_get_status() to
// drive or query that one instance. The shared board/clock port is brought up once via
// open()/close(); the app owns the multi-instance ordering.
typedef struct dspic33ak_spi_i2s_tdm_inst_s dspic33ak_spi_i2s_tdm_inst_t;

// Stream status snapshot. block_count is the number of completed audio
// blocks delivered since the last start(); one block = block_frames (DSPIC33AK_TDM_BLOCK_FRAMES)
// frames per direction. load is the block-ISR load monitor (same data as
// get_load()). block_deadline_miss_count is the number of
// times the RX-block ISR fell a full block behind (HALF+DONE conflict) since start()
// -- the real-time/stream-health metric for this zero-copy engine. It is DISTINCT
// from SPI HW FIFO over/underrun flags.
// `running` is the true stream-running state -- set by start(), cleared by stop().
// It is DISTINCT from `active`: `active`
// (is_active()) is the clock/source-readiness gate (e.g. external USB audio clock
// present) that the Perseus main loop uses to decide whether streaming *should*
// run, and it can read true while the stream is stopped. Read `running` for "is
// the engine actually streaming", `active` for "is the clock source ready".
typedef struct {
    bool                        active;       // is_active(): clock/source readiness (NOT running)
    bool                        running;      // is_running(): stream actually started (start..stop)
    uint32_t                    block_count;  // completed blocks since start()
    uint32_t                     block_deadline_miss_count; // HALF+DONE conflicts since start()
    dspic33ak_spi_i2s_tdm_load_t load;         // block-ISR load/time monitor
} dspic33ak_spi_i2s_tdm_status_t;


//===========================================================
// Board/clock PORT (optional hooks). The HAL core is board-free: instead of
// calling the board adapter directly, it routes pin routing + external-clock
// concerns through this fn-pointer table, which the platform layer
// (audio_app) registers via set_port(). ALL of these hooks are consumed by open()
// (NOT by the start* calls). Every field is optional; the fallible hooks return bool
// (false => open() aborts and returns false) and take the role open() derived from the
// committed primary leg, so the platform can act differently for master vs slave:
//   - configure_pins(role)  : PPS/GPIO routing for the role. false => unsupported
//                             pin config (e.g. a role this board cannot drive) =>
//                             open() fails. NULL => core does no pin routing.
//   - clc_passthrough(role) : CLC bypass route (slave clock fan-out). false =>
//                             open() fails. NULL => skipped.
//   - clock_source_init(role): bring up an external (e.g. USB-audio) clock. false
//                             => open() fails. NULL => no external clock to bring up.
//   - clock_source_ready(role): external-clock readiness; drives is_active() and a
//                             non-blocking check in OPEN() (open() does NOT wait -- it returns
//                             false if not ready, leaving retry to the platform/app). It is ALSO
//                             re-checked once by each start path (inst_start/start_domain/
//                             start_all_domains) immediately before arming, so a source that
//                             drops between open() and start fails the start (ERR_CLOCK_NOT_READY)
//                             rather than entering a dead stream. NULL => always ready (no gate).
//   - consume_clock_event() : read-and-clear the ext-clock stop/resume edge; NULL
//                             => always NONE.
// With NO port registered the core behaves as a self-clocked transport with no
// readiness gate (is_active()==true, no events).
//===========================================================
typedef struct {
    bool (*configure_pins)( dspic33ak_spi_i2s_tdm_clock_role_t role );
    bool (*clc_passthrough)( dspic33ak_spi_i2s_tdm_clock_role_t role );
    bool (*clock_source_init)( dspic33ak_spi_i2s_tdm_clock_role_t role );
    bool (*clock_source_ready)( dspic33ak_spi_i2s_tdm_clock_role_t role );
    dspic33ak_spi_i2s_tdm_clock_event_t (*consume_clock_event)( void );
} dspic33ak_spi_i2s_tdm_port_t;


//===========================================================
// HAL API. The transport's entry points:
//   - set_port()         : register the board/clock port (above). Call before
//                          inst_configure()/open(); NULL reverts to the self-clocked,
//                          no-gate default.
//   - spi1()/spi2()      : per-physical-SPI instance handles.
//   - inst_configure()   : validate + store a config_t for one instance (no HW write).
//   - set_block_callback(): register one instance's per-block event callback.
//   - open()/close()     : shared board/clock port bring-up/teardown (once for the
//                          engine, role-aware) -- see the per-instance lifecycle block
//                          below.
//   - inst_start()/inst_stop(): SINGLE-mode, PRIMARY-only per-instance lifecycle (a single-leg
//                          driver): configure the primary -> open() -> inst_start(primary) ->
//                          ... -> inst_stop(primary) -> close(). inst_start() returns true only
//                          if it actually started (false, instance stopped, if the wrong
//                          config-mode/leg, not configured, already running, the clock is not
//                          ready, or DMA setup fails) and never blocks. A co-clocked group uses
//                          the domain API below.
//   - is_active()        : clock/source readiness gate (NOT running).
//   - is_running()       : primary-leg running state (start..stop).
//   - get_load()/get_status()       : primary leg (default SPI1) load / status.
//   - inst_get_load()/inst_get_status(): a specific instance's load / status.
//   - inst_get_setup()   : read a specific instance's committed {stream, sync_domain}.
//   (DMA interrupt vectors: default (DSPIC33AK_TDM_DEFINE_DMA_VECTORS=1) the HAL owns
//    the _DMAnInterrupt vectors -- the integrator writes no ISR code. Opt-out (=0): the
//    integrator owns the IVT and calls dspic33ak_spi_i2s_tdm_inst_rx_isr() from their
//    own vector. TX is interrupt-less. Each RX vector is bound to its leg's conf.h RX-DMA
//    channel by a compile-time assert -- change the channel in conf.h and the vector follows;
//    a mismatch fails the build.)
//===========================================================

