sulaolab/dspic33ak-spi-i2s-tdm-hal/src/dspic33ak_spi_i2s_tdm.h
// Register the board/clock port (fn-pointer hooks above). Pass NULL to clear it
// (revert to the self-clocked, no-gate default). Call before inst_configure()/open()
// (e.g. from the platform layer at init). The pointer is stored, not copied -- it
// must outlive the stream (use a static/const table). Returns false (port unchanged,
// ERR_ALREADY_OPEN) if the port is already open()'d or any leg is running -- open()
// consumes the hooks, so the port must be fixed before open().
extern bool dspic33ak_spi_i2s_tdm_set_port( const dspic33ak_spi_i2s_tdm_port_t* port );

// Instance handles. The leg count is configurable (DSPIC33AK_TDM_USE_SPI2). instance_count()
// returns how many instances this build has; inst(i) returns the i-th handle in leg-table
// order (0 = leg SPI1, the default primary leg) or NULL if i is out of range. Together they
// let a caller enumerate instances (for i in 0 .. instance_count()-1: inst(i)). spi1()/spi2()
// are name-stable convenience wrappers: spi1() is the first instance; spi2() is the second,
// or NULL when only one is built (DSPIC33AK_TDM_USE_SPI2 == 0). Use the handle with
// set_block_callback(). (The Perseus CMSIS-SAI wrapper maps Driver_SAI0 -> spi1().)
extern uint8_t                       dspic33ak_spi_i2s_tdm_instance_count( void );
extern dspic33ak_spi_i2s_tdm_inst_t* dspic33ak_spi_i2s_tdm_inst( uint8_t index );
extern dspic33ak_spi_i2s_tdm_inst_t* dspic33ak_spi_i2s_tdm_spi1( void );
extern dspic33ak_spi_i2s_tdm_inst_t* dspic33ak_spi_i2s_tdm_spi2( void );

//===========================================================
// CANDIDATE / non-generic API (co-clocked dual-codec support). The four functions below
// exist for the Perseus single-producer co-clocked A/B path (one leg's callback fills the
// other leg's TX, plus phase probes measuring SPI1/SPI2 alignment). A generic single- or
// independent-instance consumer does NOT need them. They are NOT part of the minimal public
// transport contract and may change or move if that minimal transport contract is narrowed or
// reorganized.
//===========================================================

// Return one instance's current writable TX ping-pong half (the half NOT being
// transmitted), or NULL if inst is NULL/stopped/unresolved. Lets an app produce one
// instance's output from ANOTHER instance's block callback so two co-clocked codecs
// stay sample-aligned (call at a block boundary; co-clocked siblings share the phase).
// NULL-check before writing.
extern int32_t* dspic33ak_spi_i2s_tdm_inst_tx_fill_ptr( dspic33ak_spi_i2s_tdm_inst_t* inst );

// Mirror a reference instance's fill half onto THIS instance's TX buffer (no live-DMA read).
// For the co-clocked single-producer dual-codec path: pass ref = the producing leg (SPI1) and
// ref_fill_half = the `dst` its block callback received; returns the same-index (safe, not-
// transmitting, full-block-valid) half of `inst` (SPI2). Keeps A/B sample-aligned, race-free.
extern int32_t* dspic33ak_spi_i2s_tdm_inst_tx_fill_ptr_mirror(
        dspic33ak_spi_i2s_tdm_inst_t*       inst,
        const dspic33ak_spi_i2s_tdm_inst_t* ref,
        const int32_t*                      ref_fill_half );

// Phase probe: which TX ping-pong half is this instance's DMA transmitting NOW?
// 0 = ping, 1 = pong, -1 = unresolved. For measuring co-clocked SPI1/SPI2 alignment.
extern int dspic33ak_spi_i2s_tdm_inst_tx_active_half( dspic33ak_spi_i2s_tdm_inst_t* inst );

// Phase probe (finer): TX DMA current read position, word offset into [0, 2*half). -1 if
// unresolved. Diff of two co-clocked legs = their sub-block sample offset.
extern int32_t dspic33ak_spi_i2s_tdm_inst_tx_active_pos( dspic33ak_spi_i2s_tdm_inst_t* inst );

// Register the per-completed-block callback for one SPI instance. The callback
// receives that instance's RX half just completed and the TX half it may fill.
// Register BEFORE inst_start(). Returns false (and changes nothing) on a contract
// violation: NULL inst, or the instance is running and the (cb,user) pair would
// change -- the callback must not be swapped or cleared mid-stream. Re-registering the
// identical (cb,user) while running is a no-op and returns true.
extern bool dspic33ak_spi_i2s_tdm_set_block_callback( dspic33ak_spi_i2s_tdm_inst_t* inst,
                                                      dspic33ak_spi_i2s_tdm_block_cb_t cb,
                                                      void* user );

// ---- Lifecycle + configuration-ownership mode ----
// The two configure paths establish a mutually-exclusive OWNERSHIP mode that selects which
// start/stop API is legal (the mode is a property of the committed configuration, INDEPENDENT
// of open/close -- close() does NOT reset it):
//   * inst_configure()  -> SINGLE mode. The per-leg PRIMARY-only API is in force:
//                          inst_configure / inst_start / inst_stop, and ONLY on the primary
//                          leg. A non-primary leg or a SYSTEM-committed stream is rejected
//                          (ERR_CONFIG_MODE). For a single-leg driver (e.g. CMSIS-SAI).
//   * configure_system() -> SYSTEM mode. The whole-system domain API is in force:
//                          configure_system / start_domain / start_all_domains / stop_domain /
//                          stop_all_domains. inst_start/inst_stop/inst_configure are rejected
//                          (ERR_CONFIG_MODE). configure_system() may full-recommit from ANY
//                          mode while closed+stopped.
// open() brings up the SHARED board/clock port (external clock + pins + CLC) ONCE for the
// engine. It takes NO role argument: the HAL derives the clock role from the COMMITTED
// primary leg (primary_leg_index) and passes THAT to the port hooks, so the pin/clock
// direction can never disagree with the configured stream. Returns false (do not start any
// instance) if the primary leg is not configured, the external clock can't be brought up /
// isn't ready, or a pin/CLC hook rejects the role. With no port registered it is a no-op
// success. A second open() while already open is an idempotent success (hooks are NOT re-run).
// It never blocks and touches no SPI/DMA. close() is the symmetric teardown: it returns false
// (stays open, ERR_ALREADY_RUNNING) if any leg is still running -- stop first -- else clears
// the open state. It is otherwise a near-no-op: the HAL deliberately never tears down PPS/CLC
// or the clock (other peripherals may depend on them; reserved for a future clock-deinit hook),
// and it does NOT change the config mode. The start paths re-check clock readiness just before
// arming, so a source that drops between open() and start() fails the start (ERR_CLOCK_NOT_READY).
// Typical sequence: configure_system() (or inst_configure the primary) -> open() ->
// start_all_domains() (or, in SINGLE mode, inst_start the primary) -> ... -> stop -> close().
extern bool dspic33ak_spi_i2s_tdm_open( void );
extern bool dspic33ak_spi_i2s_tdm_close( void );
extern bool dspic33ak_spi_i2s_tdm_inst_configure( dspic33ak_spi_i2s_tdm_inst_t* inst,
                                                  const dspic33ak_spi_i2s_tdm_config_t* cfg );

// Per-leg setup for the whole-system configure below: the stream config PLUS the leg's
// sync domain, so BOTH become single-sourced from the caller's topology description (the
// sync domain is no longer taken only from the compile-time conf.h macro).
typedef struct {
    dspic33ak_spi_i2s_tdm_config_t stream;        // full per-leg transport config
    uint8_t                        sync_domain;   // co-clocked legs share an id; async legs differ
} dspic33ak_spi_i2s_tdm_leg_setup_t;

// Configure ALL legs in one TRANSACTIONAL call: setups[i] targets leg index i, and
// setup_count MUST equal the built leg count. Two passes with all-or-nothing semantics:
//   1. PREFLIGHT (zero side effects): every leg must be stopped, its stream must pass the
//      envelope check, its sync_domain must be < 32, each sync domain may contain at most one
//      clock MASTER, and legs sharing a sync domain must agree on the frame interpretation
//      (format/word_bits/slots/block/SPIFE/CKP/CKE/fs_shape). If ANY check fails the whole call
//      is rejected and NOT a single leg is touched. (start_domain re-checks these invariants at
//      start, so the per-leg inst_configure() path is guarded too.)
//   2. COMMIT: only after a fully clean preflight, every leg's config + sync_domain +
//      config_valid are stored together. There is thus no partially-configured state --
//      never SPI1 on the new config while SPI2 keeps the old.
// The caller owns the stop->configure->start contract (configure_system does NOT stop a
// running transport; it rejects one). Replaces per-leg inst_configure + any app-side role
// rewrite: the caller hands resolved per-leg setups and gets all-or-nothing.
extern bool dspic33ak_spi_i2s_tdm_configure_system( const dspic33ak_spi_i2s_tdm_leg_setup_t* setups,
                                                    uint8_t setup_count );

// Read one leg's COMMITTED setup (the config stored by inst_configure/configure_system, plus
// its sync domain) into *setup. Returns false -- and touches neither *setup nor the last-error
// (pure query) -- if inst is NULL, setup is NULL, or the leg is not configured (config_valid
// == false). Lets a board port hook route that leg's pins/CLC from the committed clock role
// with no side table, and lets a caller distinguish "unconfigured" from a valid SLAVE (role
// value 0). An optional leg left unconfigured (e.g. a single-instance CMSIS run that only
// configured the primary) returns false, so the caller can SKIP it rather than assume a role.
extern bool dspic33ak_spi_i2s_tdm_inst_get_setup( const dspic33ak_spi_i2s_tdm_inst_t* inst,
                                                  dspic33ak_spi_i2s_tdm_leg_setup_t* setup );
// SINGLE-mode, PRIMARY-only per-leg start/stop (a co-clocked group or non-primary leg must use
// start_domain/start_all_domains). inst_start() returns false (ERR_CONFIG_MODE) unless the stream
// was committed via inst_configure() AND inst is the primary leg; it also re-checks clock
// readiness before arming. inst_stop() likewise returns false (ERR_CONFIG_MODE) in SYSTEM mode or
// for a non-primary leg; true after the (idempotent) teardown.
extern bool dspic33ak_spi_i2s_tdm_inst_start( dspic33ak_spi_i2s_tdm_inst_t* inst );
extern bool dspic33ak_spi_i2s_tdm_inst_stop( dspic33ak_spi_i2s_tdm_inst_t* inst );
// NOTE: the internal arm/go split (program+arm DMA/SPI with the module OFF, then release SPIEN
// back-to-back so co-clocked legs latch one FS edge = phase-locked) is NOT public. It has no
// armed-state / open-gate of its own, so exposing it would let a caller enable SPI out of
// sequence. Phase-locked co-clocked startup is delivered through start_domain() /
// start_all_domains() (which arm then release internally); a single leg uses inst_start().

// Sync-domain group start/stop -- the SYSTEM-mode API (stream committed via configure_system()).
// A domain = the set of legs sharing sync_domain. start_domain arms all members then releases
// SPIEN back-to-back (non-master legs first, clock-master last) so co-clocked members latch one FS
// edge = phase-locked. start_all_domains starts every domain once. open() must run first. All four
// return false with ERR_CONFIG_MODE if the stream was committed via inst_configure() (SINGLE mode)
// -- a SINGLE-mode stream starts/stops through inst_start()/inst_stop(). stop_domain/stop_all_domains
// return true after teardown (idempotent on an already-stopped SYSTEM domain).
extern bool dspic33ak_spi_i2s_tdm_start_domain( uint8_t domain );
extern bool dspic33ak_spi_i2s_tdm_stop_domain( uint8_t domain );
extern bool dspic33ak_spi_i2s_tdm_start_all_domains( void );
extern bool dspic33ak_spi_i2s_tdm_stop_all_domains( void );

// Return the clock/source readiness gate. This can be true while the transport is
// stopped; use is_running() when the question is "is audio streaming now?"
extern bool dspic33ak_spi_i2s_tdm_is_active( void );

// Return true only after start() succeeds and before stop() begins.
extern bool dspic33ak_spi_i2s_tdm_is_running( void );   // true stream-running state (start..stop)

