sulaolab/dspic33ak-spi-i2s-tdm-hal/src/dspic33ak_spi_i2s_tdm.h
// Consume one external-clock stop/resume edge from the board port, or NONE when
// no event/hook exists.
extern dspic33ak_spi_i2s_tdm_clock_event_t dspic33ak_spi_i2s_tdm_consume_clock_event( void );  // external-clock stop/resume edge

// NOTE: the transport is RATE-AGNOSTIC -- there is intentionally NO sample-rate API
// (no notify / get / set-callback / is-supported / rate_state). The HAL runs at the
// configured BRG (master) or the incoming external clock (slave) and never derives
// anything from a sample-rate value. Sample-rate POLICY is NOT a HAL property: the
// product/board's supported-rate set lives in the app layer (APP_SAMPLE_RATE_IS_SUPPORTED),
// used by the CMSIS-SAI wrapper to validate ARM_SAI AUDIO_FREQ. Runtime rate DETECTION +
// the stop->reconfigure->start it drives live in the application.

// Snapshot the load monitor / status. The singleton forms report the PRIMARY leg
// (primary_leg_index, default SPI1); the inst forms report a specific instance (use spi1()/spi2()).
// For the inst forms, block_count/deadline_miss/load AND running are that instance's;
// only active (the clock/source readiness gate) is engine-wide/shared.
// clear_peak resets that instance's min/max/event peaks after the snapshot.
extern bool dspic33ak_spi_i2s_tdm_get_load( dspic33ak_spi_i2s_tdm_load_t* monitor, bool clear_peak );
extern bool dspic33ak_spi_i2s_tdm_get_status( dspic33ak_spi_i2s_tdm_status_t* status, bool clear_peak );
extern bool dspic33ak_spi_i2s_tdm_inst_get_load( dspic33ak_spi_i2s_tdm_inst_t* inst,
                                                 dspic33ak_spi_i2s_tdm_load_t* monitor,
                                                 bool clear_peak );
extern bool dspic33ak_spi_i2s_tdm_inst_get_status( dspic33ak_spi_i2s_tdm_inst_t* inst,
                                                   dspic33ak_spi_i2s_tdm_status_t* status,
                                                   bool clear_peak );


// Last-error diagnostic. The bool-returning calls (set_port / open / close / inst_configure /
// configure_system / inst_start / inst_stop / start_domain / start_all_domains / stop_domain /
// stop_all_domains / set_block_callback) collapse several failure causes into one `false`;
// get_last_error() returns the most specific reason recorded by the most recent such call
// (ERR_NONE after a success). This is a DEBUG aid only -- NOT stream health: deadline misses /
// block counts live in get_status(), not here. It is the "last failed API reason", not a
// per-instance latch, and is intentionally not strictly interrupt/multi-core safe (a plain
// last-writer-wins store -- adequate as a 16-bit-MCU debug hint).
typedef enum {
    DSPIC33AK_SPI_I2S_TDM_ERR_NONE = 0,
    DSPIC33AK_SPI_I2S_TDM_ERR_BAD_INSTANCE,        // NULL / out-of-range instance handle
    DSPIC33AK_SPI_I2S_TDM_ERR_BAD_ARGUMENT,        // NULL cfg / other bad argument
    DSPIC33AK_SPI_I2S_TDM_ERR_NOT_CONFIGURED,      // start before a successful configure
    DSPIC33AK_SPI_I2S_TDM_ERR_ALREADY_RUNNING,     // start/configure while running
    DSPIC33AK_SPI_I2S_TDM_ERR_UNSUPPORTED_CONFIG,  // configure envelope rejected (format/slots/blk)
    DSPIC33AK_SPI_I2S_TDM_ERR_TOPOLOGY,            // resource/domain topology: duplicate SPI/DMA, >1
                                                   // clock MASTER or a framing mismatch within a sync
                                                   // domain, bad primary index, or sync_domain >= 32
    DSPIC33AK_SPI_I2S_TDM_ERR_CLOCK_INIT,          // port clock_source_init hook failed
    DSPIC33AK_SPI_I2S_TDM_ERR_CLOCK_NOT_READY,     // port clock_source_ready hook not ready
    DSPIC33AK_SPI_I2S_TDM_ERR_PIN_CONFIG,          // port configure_pins hook failed
    DSPIC33AK_SPI_I2S_TDM_ERR_CLC,                 // port clc_passthrough hook failed
    DSPIC33AK_SPI_I2S_TDM_ERR_DMA_CONFIG,          // DMA channel setup failed
    DSPIC33AK_SPI_I2S_TDM_ERR_NOT_OPEN,            // start/arm attempted before a successful open()
    DSPIC33AK_SPI_I2S_TDM_ERR_ALREADY_OPEN,        // configure/set_port attempted while open()'d
    DSPIC33AK_SPI_I2S_TDM_ERR_CONFIG_MODE,         // wrong configure-ownership mode for this call
                                                   // (e.g. inst_* under SYSTEM / a non-primary leg,
                                                   // or start_domain under SINGLE)
} dspic33ak_spi_i2s_tdm_error_t;

extern dspic33ak_spi_i2s_tdm_error_t dspic33ak_spi_i2s_tdm_get_last_error( void );

// DMA interrupt vectors: by default (DSPIC33AK_TDM_DEFINE_DMA_VECTORS=1, conf.h) the HAL
// DEFINES the _DMAnInterrupt vectors itself (one RX vector per instance descriptor row),
// so the integrator writes NO interrupt/DMA code -- just registers a per-instance block
// callback. TX is interrupt-less (fire-and-forget ping-pong with auto-reload; hw.c
// enables the CPU IRQ on the RX channel only). RX/TX channel numbers come from conf.h and
// are baked in as compile-time constants so the DMA register access folds. The HAL-owned RX
// vectors are EXPLICIT (_DMA0Interrupt / _DMA2Interrupt for the default channels), each bound
// to its leg's conf.h RX-DMA channel by a compile-time assert -- so simply changing a leg's
// RX-DMA channel in conf.h fails the build until the matching explicit vector in the core
// source is updated too (the vector name does not auto-follow). To hand an IVT slot to another
// subsystem without touching the core, take full vector ownership: set
// DSPIC33AK_TDM_DEFINE_DMA_VECTORS=0 (the HAL then defines no vectors) and call inst_rx_isr()
// below from your own _DMA<rx>Interrupt for each instance. (See conf.h_example for the same note.)

// RX-block ISR entry for one instance, for the DSPIC33AK_TDM_DEFINE_DMA_VECTORS=0
// (vector-ownership opt-out) path: call it from your own _DMA<rx>Interrupt for that
// instance's RX channel (TX is interrupt-less -- never call it for a TX channel). It runs
// the same block work as the HAL's generated vector. A NULL inst is ignored. In the
// default turnkey build (=1) you do not call this -- the HAL's own vectors do the work.
extern void dspic33ak_spi_i2s_tdm_inst_rx_isr( dspic33ak_spi_i2s_tdm_inst_t* inst );



#endif // DSPIC33AK_SPI_I2S_TDM_H
